app/workers/counter_worker.rb

  def perform
    # Do something
      if Conversion.find_by(date: Date.today) == nil
        puts "wrong"
      #count_today = Conversion.create(:date => Date.today , :count => 1)
      Conversion.create(:date => Date.today , :count => 0)
    else
      puts "correct"
    	count_today = Conversion.find_by(date: Date.today)
      puts count_today.count
    	live_count = count_today.count
    	count_today.update(count: live_count + 1)
---
SELECT  "conversions".* FROM "conversions" WHERE "conversions"."date" = $1 LIMIT $2  [["date", "2019-01-25"], ["LIMIT", 1]]
INSERT INTO "conversions" ("date", "count", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["date", "2019-01-26"], ["count", 0], ["created_at", "2019-01-26 10:23:26.439288"], ["updated_at", "2019-01-26 10:23:26.439288"]]
UPDATE "conversions" SET "count" = $1, "updated_at" = $2 WHERE "conversions"."id" = $3  [["count", 12], ["updated_at", "2019-01-25 09:09:17.119252"], ["id", 1]]