app/helpers/urls_helper.rb

	def new_long_incoming(long_url)
		#Rails.cache.clear
		if Url.find_by(long_url: long_url) == nil
			 @urls = Url.new({:long_url => long_url, :short_url => convert_to_short})
			 @urls.save
			 return Url.find_by(long_url: long_url).short_url
		else
			@short_url = Rails.cache.fetch(long_url , :expires_in => 5.minutes) do

				Url.where(long_url: long_url).first.short_url
---
SELECT  "urls".* FROM "urls" WHERE "urls"."long_url" = $1 LIMIT $2  [["long_url", "mithi"], ["LIMIT", 1]]
INSERT INTO "urls" ("long_url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["long_url", "kaustubh"], ["short_url", "Frd4eHD"], ["created_at", "2019-01-23 05:18:20.598772"], ["updated_at", "2019-01-23 05:18:20.598772"]]
SELECT  "urls".* FROM "urls" WHERE "urls"."long_url" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["long_url", "mithi"], ["LIMIT", 1]]

	def find_long_url(short_url)
		if Url.find_by(short_url: short_url) == nil
			flash[:error] = "no such short url"
			render urls_new_path
			return
		else
			@long_url = Rails.cache.fetch(short_url , :expires_in => 5.minutes) do

				Url.where(short_url: short_url).first.long_url
---
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = $1 LIMIT $2  [["short_url", "X1iAV5A"], ["LIMIT", 1]]
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["short_url", "X1iAV5A"], ["LIMIT", 1]]