app/controllers/conversions_controller.rb

	def show
		@conversion = Conversion.all
---
SELECT "conversions".* FROM "conversions"