app/controllers/conversions_controller.rb

	def index
		@conversion = Conversion.all
---
SELECT "conversions".* FROM "conversions"