app/controllers/search_controller.rb

	def search
  		if params[:q].nil?
    		@urls = []
  		else
    		@urls = Url.search params[:q]
---
SELECT "urls".* FROM "urls" WHERE 1=0