app/controllers/urls_controller.rb

SELECT  "conversions".* FROM "conversions" WHERE "conversions"."date" = $1 LIMIT $2  [["date", "2019-01-25"], ["LIMIT", 1]]
---
	def new

		session_timeout(5)

		is_session_over_yes

		@conv = Conversion.find_by(date: Date.today)

SELECT  "conversions".* FROM "conversions" WHERE "conversions"."date" = $1 LIMIT $2  [["date", "2019-01-23"], ["LIMIT", 1]]
---
	def convert_long
		is_session_over_yes
		long_to_short

		@conv = Conversion.find_by(date: Date.today)

SELECT  "conversions".* FROM "conversions" WHERE "conversions"."date" = $1 LIMIT $2  [["date", "2019-01-25"], ["LIMIT", 1]]
---
	def convert_short
		is_session_over_yes
		short_to_long
		@conv = Conversion.find_by(date: Date.today)

SELECT  "conversions".* FROM "conversions" WHERE "conversions"."date" = $1 LIMIT $2  [["date", "2019-01-28"], ["LIMIT", 1]]
---
	def short_to_long
		@req_ans = Url.find_long_url(params[:short])

		if @req_ans == false
			flash[:error] = "no such short url"
			@conv = Conversion.find_by(date: Date.today)