app/models/conversion.rb

SELECT  "conversions".* FROM "conversions" WHERE "conversions"."date" = $1 LIMIT $2  [["date", "2019-01-30"], ["LIMIT", 1]]
---
	def self.get_conv
		return Conversion.find_by(date: Date.today)