app/models/url.rb

	def self.shorten_url(long_url , long_domain)
		number = 62
		if Url.find_by(long_url: long_url) == nil
			short_domain = Url.find_short_domain(long_domain)

			possible_short = UrlsHelper.random_n_string(7,number)
			while Url.find_by(short_url: possible_short) != nil do
				possible_short = UrlsHelper.random_n_string(7,number)
			end

			@short_url = Url.create({:long_url => long_url, :short_url => possible_short , :short_domain => short_domain})
			#@urls.save
			return (short_domain)+"/"+(Url.find_by(long_url: long_url).short_url)
		else
			@short_url = Rails.cache.fetch(long_url , :expires_in => 5.minutes) do

				(Url.where(long_url: long_url).first.short_domain )+"/" +(Url.where(long_url: long_url).first.short_url)
---
SELECT  "urls".* FROM "urls" WHERE "urls"."long_url" = $1 LIMIT $2  [["long_url", "mithi"], ["LIMIT", 1]]
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = $1 LIMIT $2  [["short_url", "KeDHh4d"], ["LIMIT", 1]]
INSERT INTO "domains" ("domain_name", "short_domain", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["domain_name", "www.facebook.com"], ["short_domain", "g07H"], ["created_at", "2019-01-23 09:35:27.006007"], ["updated_at", "2019-01-23 09:35:27.006007"]]
INSERT INTO "urls" ("long_url", "short_url", "short_domain", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "honey"], ["short_url", "BluJOor"], ["short_domain", "XgVA"], ["created_at", "2019-01-23 10:06:21.021463"], ["updated_at", "2019-01-23 10:06:21.021463"]]
SELECT  "urls".* FROM "urls" WHERE "urls"."long_url" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["long_url", "mithi"], ["LIMIT", 1]]

	def self.new_long_incoming(long_url ,dom_short , number)
		#Rails.cache.clear
		if Url.find_by(long_url: long_url) == nil

			possible_short = UrlsHelper.random_n_string(number)
			while Url.find_by(short_url: possible_short) != nil do
				possible_short = UrlsHelper.random_n_string(number)
			end

			@urls = Url.create({:long_url => long_url, :short_url => possible_short , :short_domain => dom_short})
			#@urls.save
			return Url.find_by(long_url: long_url).short_url
---
SELECT  "urls".* FROM "urls" WHERE "urls"."long_url" = $1 LIMIT $2  [["long_url", "mithi"], ["LIMIT", 1]]
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["short_url", "X1iAV5A"], ["LIMIT", 1]]
INSERT INTO "urls" ("long_url", "short_url", "short_domain") VALUES ($1, $2, $3) RETURNING "id"  [["long_url", "kartik"], ["short_url", "iuBnQlM"], ["short_domain", "NNxT"]]
SELECT  "urls".* FROM "urls" WHERE "urls"."long_url" = $1 LIMIT $2  [["long_url", "chimchar"], ["LIMIT", 1]]

	def self.find_short_domain(long_domain)
		number = 52
		#Rails.cache.clear
		if Domain.find_by(domain_name: long_domain) == nil
			possible_domain = UrlsHelper.random_n_string(4,number)
			while Domain.find_by(short_domain: possible_domain) != null do
				possible_domain = UrlsHelper.random_n_string(4,number)
			end

			 @short_domain = Domain.create({:domain_name => long_domain, :short_domain => possible_domain})
			 #@domains.save
			 return Domain.find_by(domain_name: long_domain).short_domain
		else
			@short_domain = Rails.cache.fetch(long_domain , :expires_in => 5.minutes) do

				Domain.where(domain_name: long_domain).first.short_domain
---
SELECT  "domains".* FROM "domains" WHERE "domains"."domain_name" = $1 LIMIT $2  [["domain_name", "youtube"], ["LIMIT", 1]]
SELECT  "domains".* FROM "domains" WHERE "domains"."domain_name" = $1 LIMIT $2  [["domain_name", "google"], ["LIMIT", 1]]

	def self.find_long_url(short_url)
		if Url.find_by(short_url: short_url) == nil
			return "no such short url exist"
		else
			@long_url = Rails.cache.fetch(short_url , :expires_in => 5.minutes) do

				Url.where(short_url: short_url).first.long_url
---
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = $1 LIMIT $2  [["short_url", "WqXulHL"], ["LIMIT", 1]]