app/models/url.rb

	def self.random_string_for_domain(number)
		possible_domain = UrlsHelper.random_n_string(4,number)
		while Domain.find_by(short_domain: possible_domain) != nil do
---
SELECT  "domains".* FROM "domains" WHERE "domains"."short_domain" = $1 LIMIT $2  [["short_domain", "bpGa"], ["LIMIT", 1]]

	def self.random_string_for_url(number)
		possible_short = UrlsHelper.random_n_string(7,number)
		while Url.find_by(short_url: possible_short) != nil do
---
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = $1 LIMIT $2  [["short_url", "F50RffL"], ["LIMIT", 1]]

	def self.shorten_url(long_url , long_domain)
		number = 62
		#Rails.cache.clear
		url_var = Url.find_by(long_url: long_url)
		if url_var == nil
			short_domain = Url.find_short_domain_admin(long_domain)
			possible_short = Url.random_string_for_url(number)

			new_entry = Url.create({:long_url => long_url, :short_url => possible_short , :short_domain => short_domain})
---
SELECT  "urls".* FROM "urls" WHERE "urls"."long_url" = $1 LIMIT $2  [["long_url", "www.youtube.com/charizard"], ["LIMIT", 1]]
SELECT  "domains".* FROM "domains" WHERE "domains"."short_domain" = $1 LIMIT $2  [["short_domain", "boCB"], ["LIMIT", 1]]
INSERT INTO "urls" ("long_url", "short_url", "short_domain") VALUES ($1, $2, $3) RETURNING "id"  [["long_url", "www.google.com/seaking"], ["short_url", "F50RffL"], ["short_domain", "go.gl"]]

	def self.new_long_incoming(long_url ,dom_short , number)
		#Rails.cache.clear
		if Url.find_by(long_url: long_url) == nil

			possible_short = UrlsHelper.random_n_string(number)
			while Url.find_by(short_url: possible_short) != nil do
---
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = $1 LIMIT $2  [["short_url", "OQMigkU"], ["LIMIT", 1]]

	def self.find_short_domain_admin(long_domain)
		domain_var = Domain.find_by(domain_name: long_domain)
---
SELECT  "domains".* FROM "domains" WHERE "domains"."domain_name" = $1 LIMIT $2  [["domain_name", "youtube"], ["LIMIT", 1]]

	def self.find_long_url(short_url)
		if Url.find_by(short_url: short_url) == nil
			return false
		else
			long_url = Rails.cache.fetch(short_url , :expires_in => 5.minutes) do

				Url.where(short_url: short_url).first.long_url
---
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["short_url", "47FbPzI"], ["LIMIT", 1]]
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = $1 LIMIT $2  [["short_url", "adada"], ["LIMIT", 1]]
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["short_url", "OQMigkU"], ["LIMIT", 1]]